src/cf/InformationRegisters/ПаспортныеДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПаспортныеДанныеФизЛиц/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработчикОповещения_ВыборПериода(Параметр1, Параметр2) Экспорт
	Если Параметр1=КодВозвратаДиалога.Нет Тогда
		Запись.Период=ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ФизЛицо" Тогда
		Заголовок="Паспортные данные: "+СокрЛП(Запись.ФизЛицо);

	ИначеЕсли Элемент.Имя="Период" Тогда
		Если Запись.Период > ТекущаяДата() Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработчикОповещения_ВыборПериода", ЭтотОбъект), "Вы действительно хотите ввести данные"+Символы.ПС+"об удостоверении личности физлица на будущую дату?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, "Подтверждение действия", КодВозвратаДиалога.Нет);
		КонецЕсли;

	ИначеЕсли Элемент.Имя="ДокументВид" Тогда
		Элементы.ДокументСерия.Маска="";
		Элементы.ДокументКодПодразделения.Маска="";
		Если Запись.ДокументВид=ПредопределенноеЗначение("Справочник.ДокументыУдостоверяющиеЛичность.ПАСПОРТ_РОССИИ") Тогда
			Элементы.ДокументСерия.Маска="99 99";
			Элементы.ДокументКодПодразделения.Маска="999-999";
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Заголовок="Данные удостоверения личности: "+?(Запись.ФизЛицо<>Неопределено, СокрЛП(Запись.ФизЛицо), "");
КонецПроцедуры
